imbluedabr/m33mu/cpu/stm32h533/stm32h533_mmio.c
static mm_u32 rcc_bus_reg(const struct rcc_state *r, enum rcc_bus_kind bus)
{
    if (r == 0) {
        return 0u;
    }
    switch (bus) {
    case RCC_BUS_AHB1:
        return r->regs[0x88 / 4];
    case RCC_BUS_AHB2:
        return r->regs[0x8c / 4];
    case RCC_BUS_APB1L:
        return r->regs[0x9c / 4];
    case RCC_BUS_APB1H:
        return r->regs[0xa0 / 4];
    case RCC_BUS_APB2:
        return r->regs[0xa4 / 4];
    case RCC_BUS_APB3:
        return r->regs[0xa8 / 4];
    default:
        return 0u;
    }
}

static const char *rcc_bus_name(enum rcc_bus_kind bus)
{
    switch (bus) {
    case RCC_BUS_AHB1: return "AHB1";
    case RCC_BUS_AHB2: return "AHB2";
    case RCC_BUS_APB1L: return "APB1L";
    case RCC_BUS_APB1H: return "APB1H";
    case RCC_BUS_APB2: return "APB2";
    case RCC_BUS_APB3: return "APB3";
    default: return "RCC";
    }
}

static mm_bool stm32h533_rcc_clock_list_line(void *opaque, int line, char *out, size_t out_len)
{
    enum rcc_bus_kind bus;
    int line_idx = 0;
    size_t i;
    (void)opaque;
    if (out == 0 || out_len == 0u) {
        return MM_FALSE;
    }
    for (bus = RCC_BUS_AHB1; bus <= RCC_BUS_APB3; ++bus) {
        mm_u32 reg = rcc_bus_reg(&rcc, bus);
        char buf[256];
        size_t pos = 0;
        mm_bool have = MM_FALSE;
        if (reg == 0u) {
            continue;
        }
        pos += snprintf(buf + pos, sizeof(buf) - pos, "%s:", rcc_bus_name(bus));
        for (i = 0; i < sizeof(rcc_clk_names) / sizeof(rcc_clk_names[0]); ++i) {
            if (rcc_clk_names[i].bus != bus) {
                continue;
            }
            if ((reg & (1u << rcc_clk_names[i].bit)) == 0u) {
                continue;
            }
            if (pos + 2u < sizeof(buf)) {
                pos += snprintf(buf + pos, sizeof(buf) - pos, " %s", rcc_clk_names[i].name);
                have = MM_TRUE;
            }
        }
        if (!have) {
            continue;
        }
        if (line_idx == line) {
            snprintf(out, out_len, "%s", buf);
            return MM_TRUE;
        }
        line_idx++;
    }
    return MM_FALSE;
}

static mm_u32 stm32h533_gpio_bank_read(void *opaque, int bank)
{
    (void)opaque;
    if (bank < 0 || bank >= (int)(sizeof(gpio) / sizeof(gpio[0]))) {
        return 0u;
    }
    return gpio[bank].regs[0x14u / 4];
}

static mm_u32 stm32h533_gpio_bank_read_moder(void *opaque, int bank)
{
    (void)opaque;
    if (bank < 0 || bank >= (int)(sizeof(gpio) / sizeof(gpio[0]))) {
        return 0u;
    }
    return gpio[bank].regs[0x00u / 4];
}

static mm_bool stm32h533_gpio_bank_clock(void *opaque, int bank)
{
    (void)opaque;
    return gpio_clock_enabled(&rcc, bank);
}

static mm_u32 stm32h533_gpio_bank_read_seccfgr(void *opaque, int bank)
{
    (void)opaque;
    if (bank < 0 || bank >= (int)(sizeof(gpio) / sizeof(gpio[0]))) {
        return 0u;
    }
    return gpio[bank].regs[0x30u / 4];
}

static mm_bool rng_clock_enabled(const struct rcc_state *rcc)
{
    /* RCC_AHB2ENR offset 0x8C, RNGEN bit18 */
    mm_u32 ahb2enr = rcc->regs[0x8c / 4];
    return ((ahb2enr >> 18) & 1u) != 0u;
}

static mm_bool rng_requires_secure(const struct simple_blk *tzsc)
{
    /* GTZC1_TZSC_SECCFGR3 offset 0x18, RNGSEC bit18 */
    mm_u32 seccfgr3 = tzsc->regs[TZSC_SECCFGR3_OFFSET / 4u];
    return ((seccfgr3 >> TZSC_RNGSEC_BIT) & 1u) != 0u;
}

static mm_bool tzsc_requires_secure(const struct simple_blk *tzsc, mm_u32 bit)
{
    mm_u32 seccfgr3;
    if (bit >= 32u) {
        return MM_FALSE;
    }
    seccfgr3 = tzsc->regs[TZSC_SECCFGR3_OFFSET / 4u];
    return ((seccfgr3 >> bit) & 1u) != 0u;
}

static mm_bool hash_requires_secure(const struct simple_blk *tzsc)
{
    return tzsc_requires_secure(tzsc, TZSC_HASHSEC_BIT);
}

static mm_bool aes_requires_secure(const struct simple_blk *tzsc, mm_bool is_saes)
{
    return tzsc_requires_secure(tzsc, is_saes ? TZSC_SAESSEC_BIT : TZSC_AESSEC_BIT);
}

static mm_bool pka_requires_secure(const struct simple_blk *tzsc)
{
    return tzsc_requires_secure(tzsc, TZSC_PKASEC_BIT);
}

static void rng_fill(struct rng_state *r)
{
    mm_u32 v = 0;
    ssize_t n = getrandom(&v, sizeof(v), GRND_NONBLOCK);
    if (n != (ssize_t)sizeof(v)) {
        v = 0;
    }
    r->dr = v;
    r->dr_valid = MM_TRUE;
    r->regs[RNG_SR_OFFSET / 4] |= 1u;
    if (g_rng_nvic != 0 && (r->regs[RNG_CR_OFFSET / 4] & (1u << 3)) != 0u) {
        mm_nvic_set_pending(g_rng_nvic, (mm_u32)RNG_IRQ, MM_TRUE);
    }
}

static mm_u32 flash_bank_count(const struct flash_state *f)
{
    if (f == 0) {
        return 1u;
    }
    return f->dualbank_enabled ? FLASH_BANK_COUNT : 1u;
}

static void flash_apply_bank_swap(struct flash_state *f)
{
    mm_u32 bank_size;
    mm_u32 i;
    if (f == 0 || f->flash == 0 || f->flash_size == 0u) {
        return;
    }
    if ((f->flash_size % 2u) != 0u) {
        return;
    }
    bank_size = f->flash_size / 2u;
    for (i = 0; i < bank_size; ++i) {
        mm_u8 tmp = f->flash[i];
        f->flash[i] = f->flash[i + bank_size];
        f->flash[i + bank_size] = tmp;
    }
    if (f->persist != 0 && f->persist->enabled) {
        mm_flash_persist_flush((struct mm_flash_persist *)f->persist, 0u, f->flash_size);
    }
}

static void flash_set_swap_state(struct flash_state *f, mm_bool swap_active)
{
    if (f == 0) {
        return;
    }
    if (!f->dualbank_enabled) {
        if (f->swap_active) {
            flash_apply_bank_swap(f);
        }
        f->swap_active = MM_FALSE;
        return;
    }
    if (f->swap_active == swap_active) {
        return;
    }
    f->swap_active = swap_active;
    flash_apply_bank_swap(f);
}

static void flash_sync_option_regs(struct flash_state *f)
{
    mm_u32 swap_bit;
    if (f == 0) {
        return;
    }
    if (!f->dualbank_enabled) {
        f->swap_active = MM_FALSE;
    }
    swap_bit = f->swap_active ? FLASH_OPTSR_SWAP_BANK : 0u;
    f->regs[FLASH_OPTSR_CUR / 4u] = (f->regs[FLASH_OPTSR_CUR / 4u] & ~FLASH_OPTSR_SWAP_BANK) | swap_bit;
    f->regs[FLASH_OPTSR_PRG / 4u] = (f->regs[FLASH_OPTSR_PRG / 4u] & ~FLASH_OPTSR_SWAP_BANK) | swap_bit;
}

static mm_u32 flash_sector_size(void)
{
    mm_u32 banks = flash_bank_count(&flash_ctl);
    if (flash_ctl.flash_size == 0u) {
        return 0u;
    }
    if (banks == 0u || (flash_ctl.flash_size % banks) != 0u) {
        banks = 1u;
    }
    return (FLASH_SECTOR_COUNT == 0u) ? 0u
        : ((flash_ctl.flash_size / banks) / FLASH_SECTOR_COUNT);
}

