imbluedabr/m33mu/cpu/stm32h533/stm32h533_mmio.c
static mm_bool simple_blk_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct simple_blk *b = (struct simple_blk *)opaque;
    if (size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > GTZC_BLK_SIZE) return MM_FALSE;
    memcpy((mm_u8 *)b->regs + offset, &value, size_bytes);
    return MM_TRUE;
}

static mm_bool mpcbb_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct mpcbb_state *b = (struct mpcbb_state *)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > MPCBB_SIZE) return MM_FALSE;
    memcpy(value_out, (mm_u8 *)b->regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool mpcbb_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct mpcbb_state *b = (struct mpcbb_state *)opaque;
    if (size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > MPCBB_SIZE) return MM_FALSE;
    memcpy((mm_u8 *)b->regs + offset, &value, size_bytes);
    return MM_TRUE;
}

static void mpcbb_init_defaults(void)
{
    mm_u32 bank;
    for (bank = 0; bank < (mm_u32)(sizeof(mpcbb) / sizeof(mpcbb[0])); ++bank) {
        mm_u32 word;
        memset(&mpcbb[bank], 0, sizeof(mpcbb[bank]));
        for (word = 0; word < mpcbb_words[bank]; ++word) {
            mpcbb[bank].regs[(MPCBB_SECCFGR_OFFSET / 4u) + word] = 0xFFFFFFFFu;
        }
    }
}

static mm_bool gpio_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct gpio_state *g = ((struct gpio_state *)((void **)opaque)[0]);
    struct rcc_state *rcc = (struct rcc_state *)((void **)opaque)[2];
    int index = (int)(mm_uptr)((void **)opaque)[3];
    mm_bool is_secure_alias = ((void **)opaque)[1] != 0;
    mm_u32 seccfgr = g->regs[0x30u / 4];
    mm_u32 v = 0;
    mm_u32 mask = ~seccfgr; /* pins accessible to NS */

    if (value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if (offset >= sizeof(g->regs)) return MM_FALSE;

    if (!gpio_clock_enabled(rcc, index)) {
        *value_out = 0;
        return MM_TRUE;
    }

    memcpy(&v, (mm_u8 *)g->regs + offset, size_bytes);

    if (!is_secure_alias) {
        if (offset == 0x30u) { /* SECCFGR */
            v = 0;
        } else if (offset == 0x10u || offset == 0x14u || offset == 0x18u || offset == 0x1cu || offset == 0x20u || offset == 0x24u || offset == 0x28u || offset == 0x2cu) {
            /* Data/bit set/reset/lock/AF/BRR/HSLVR: mask secure pins */
            v &= mask;
        } else if (offset <= 0x0cu || offset == 0x04u || offset == 0x08u) {
            /* config registers are readable but secure bits masked */
            v &= mask | (mask << 16); /* apply per-bit twice per 2 bits? conservative: mask low 16 bits */ 
        }
    }

    *value_out = v;
    return MM_TRUE;
}

static void gpio_apply_brr(struct gpio_state *g, mm_u32 bits, mm_u32 mask)
{
    g->regs[0x14u / 4] &= ~(bits & mask);
}

static void gpio_apply_bsrr(struct gpio_state *g, mm_u32 val, mm_u32 mask)
{
    mm_u32 set = val & 0xFFFFu;
    mm_u32 reset = (val >> 16) & 0xFFFFu;
    mm_u32 odr = g->regs[0x14u / 4];
    odr |= (set & mask);
    odr &= ~(reset & mask);
    g->regs[0x14u / 4] = odr;
}

static void gpio_sync_odr(struct gpio_state *g, int bank, mm_u32 old_odr)
{
    mm_u32 new_odr = g->regs[GPIO_ODR_OFFSET / 4];
    if (new_odr != old_odr) {
        g->regs[GPIO_IDR_OFFSET / 4] = new_odr;
        exti_gpio_update(bank, old_odr, new_odr);
    }
}

static mm_u32 gpio_mask_to_2bit(mm_u32 mask)
{
    mm_u32 out = 0;
    int i;
    for (i = 0; i < 16; ++i) {
        if ((mask & (1u << i)) != 0u) {
            out |= (3u << (i * 2));
        }
    }
    return out;
}

static mm_bool gpio_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct gpio_state *g = ((struct gpio_state *)((void **)opaque)[0]);
    struct rcc_state *rcc = (struct rcc_state *)((void **)opaque)[2];
    int index = (int)(mm_uptr)((void **)opaque)[3];
    mm_bool is_secure_alias = ((void **)opaque)[1] != 0;
    mm_u32 seccfgr = g->regs[0x30u / 4];
    mm_u32 mask = ~seccfgr;

    if (size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if (offset >= sizeof(g->regs)) return MM_FALSE;

    if (!gpio_clock_enabled(rcc, index)) {
        return MM_TRUE; /* WI if disabled */
    }

    /* Non-secure alias write handling */
    if (!is_secure_alias) {
        if (offset == 0x30u) {
            /* SECCFGR is Secure-only: WI */
            return MM_TRUE;
        }
        /* Mask out secure pins */
        if (offset == 0x18u) { /* BSRR */
            mm_u32 old_odr = g->regs[GPIO_ODR_OFFSET / 4];
            gpio_apply_bsrr(g, value, mask & 0xFFFFu);
            gpio_sync_odr(g, index, old_odr);
            return MM_TRUE;
        } else if (offset == 0x28u) { /* BRR */
            mm_u32 old_odr = g->regs[GPIO_ODR_OFFSET / 4];
            gpio_apply_brr(g, value & 0xFFFFu, mask & 0xFFFFu);
            gpio_sync_odr(g, index, old_odr);
            return MM_TRUE;
        } else {
            /* General regs: apply mask */
            if (offset == 0x00u) { /* MODER: 2 bits per pin */
                mm_u32 m2 = gpio_mask_to_2bit(mask & 0xFFFFu);
                value &= (m2 | (m2 << 16));
            } else {
                value &= (mask | (mask << 16));
            }
        }
    }

    if (offset == 0x18u) { /* BSRR */
        mm_u32 old_odr = g->regs[GPIO_ODR_OFFSET / 4];
        gpio_apply_bsrr(g, value, 0xFFFFu);
        gpio_sync_odr(g, index, old_odr);
        return MM_TRUE;
    }
    if (offset == 0x28u) { /* BRR */
        mm_u32 old_odr = g->regs[GPIO_ODR_OFFSET / 4];
        gpio_apply_brr(g, value & 0xFFFFu, 0xFFFFu);
        gpio_sync_odr(g, index, old_odr);
        return MM_TRUE;
    }

    if (offset == GPIO_ODR_OFFSET) {
        mm_u32 old_odr = g->regs[GPIO_ODR_OFFSET / 4];
        memcpy((mm_u8 *)g->regs + offset, &value, size_bytes);
        gpio_sync_odr(g, index, old_odr);
        return MM_TRUE;
    }

    memcpy((mm_u8 *)g->regs + offset, &value, size_bytes);
    return MM_TRUE;
}

static mm_bool gpdma_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct gpdma_state *d = (struct gpdma_state *)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > sizeof(d->regs)) return MM_FALSE;
    memcpy(value_out, (mm_u8 *)d->regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool gpdma_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct gpdma_state *d = (struct gpdma_state *)opaque;
    if (size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > sizeof(d->regs)) return MM_FALSE;
    memcpy((mm_u8 *)d->regs + offset, &value, size_bytes);
    return MM_TRUE;
}

static mm_bool flash_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct flash_state *f = (struct flash_state *)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > FLASH_SIZE) return MM_FALSE;
    memcpy(value_out, (mm_u8 *)f->regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool flash_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct flash_state *f = (struct flash_state *)opaque;
    mm_u32 cr_off;
    mm_u32 sr_off;
    if (size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > FLASH_SIZE) return MM_FALSE;

    if (offset == FLASH_NSKEYR || offset == FLASH_SECKEYR) {
        flash_handle_key(offset, value);
        return MM_TRUE;
    }

    if (offset == FLASH_OPTSR_CUR || offset == FLASH_OPTSR_PRG) {
        mm_u32 new_val = value;
        if (!f->dualbank_enabled) {
            new_val &= ~FLASH_OPTSR_SWAP_BANK;
        }
        f->regs[offset / 4u] = (f->regs[offset / 4u] & ~FLASH_OPTSR_SWAP_BANK) | (new_val & FLASH_OPTSR_SWAP_BANK);
        if (offset == FLASH_OPTSR_PRG) {
            f->regs[FLASH_OPTSR_CUR / 4u] = (f->regs[FLASH_OPTSR_CUR / 4u] & ~FLASH_OPTSR_SWAP_BANK) | (new_val & FLASH_OPTSR_SWAP_BANK);
        }
        flash_set_swap_state(f, (new_val & FLASH_OPTSR_SWAP_BANK) != 0u);
        return MM_TRUE;
    }

    if (offset == FLASH_NSCCR || offset == FLASH_SECCCR) {
        sr_off = (offset == FLASH_NSCCR) ? FLASH_NSSR : FLASH_SECSR;
        if ((value & (1u << 16)) != 0u) {
            flash_clear_eop(sr_off);
        }
        return MM_TRUE;
    }

